/**
 * @file    memory_scan.h
 * @brief   内存扫描接口
 * @author  Intewell Team
 * @date    2025-01-21
 * @version 1.0
 *
 * @details 本文件定义内存扫描相关接口
 *          用于内存管理和调试
 *
 * @note MISRA-C:2012 合规
 *
 * @copyright Copyright (c) 2025 Intewell Team
 */

#ifndef _MEMORY_SCAN_H
#define _MEMORY_SCAN_H

/************************头 文 件******************************/

/************************宏 定 义******************************/
/************************类型定义******************************/
/************************外部变量******************************/
/************************外部函数******************************/

/************************内联函数******************************/

/************************C++兼容性******************************/
#ifdef __cplusplus
extern "C"
{
#endif

#ifdef __cplusplus
}
#endif

#endif /* _MEMORY_SCAN_H */
