/**
 * @file    regsLoongarch.h
 * @brief   LoongArch64寄存器定义
 * @author  Intewell Team
 * @date    2025-01-21
 * @version 1.0
 *
 * @details 本文件定义LoongArch64架构的寄存器接口
 *          提供寄存器访问的统一接口
 *
 * @note MISRA-C:2012 合规
 *
 * @copyright Copyright (c) 2025 Intewell Team
 */

#ifndef _REGSLOONGARCH_H__
#define _REGSLOONGARCH_H__

/************************头 文 件******************************/

/************************宏 定 义******************************/
/************************类型定义******************************/
/************************外部变量******************************/
/************************外部函数******************************/

/************************内联函数******************************/

/************************C++兼容性******************************/
#ifdef __cplusplus
extern "C"
{
#endif

#ifdef __cplusplus
}
#endif

#endif /* _REGSLOONGARCH_H__ */
